# 2) კომენტარების სახით ახსენით თუ რა არის ფუნქცია, კარგად გაიაზრეთ

#ფუნქცია არის კოდის ბლოკი რომელიც ასრულებს კონკრეტულ ამოცანას და რომელსაც შეუძლია მიიღოს პარამეტრები და დააბრუნოს შედეგი.
#ფუნქციები გვაძლევს საშუალებას გავიმეოროთ კოდის გამოყენება, რაც ზრდის კოდის ეფექტურობას და წაკითხვის სიმარტივეს.

# 3) შექმენით მასივი, შეინახეთ მასში მნიშვნელობები, თქვენი დავალებაა, რომ მოიპოვოთ წვდომა მასივის index - ებზე, ასევე ახსენით თუ რა უნდა გავაკეთოთ ჩვენ იმისათვის, რომ გავიგოთ მასივში არსებული ელემენტების index - ები

eg_mass = ['Atom', 'Molecule', 'Ion', 'Compound', 'Microorganism']
print(eg_mass[0]) #Atom
print(eg_mass[2]) #Ion

#მასივში არსებული ელემენტების indexების გასაგებად, ჩვენ უნდა დავიწყოთ დათვლა 0იდან და გავაგრძელოთ თითოეული ელემენტის მიხედვით.

print('----------------------------------------')

# 4)

eg_names = ['VALERI', 'KUKURA', 'SIMONA', 'TAKUNA', 'JORA']
eg_names[2] = 'VALERIANI' #Changing index 2 value to VALERIANI
print(eg_names)

print('----------------------------------------')


# 5) მოიძიეთ დამატებითი ინფორმაცია string method - ების შესახებ, მომხმარებელს შემოატანინეთ მისი სახელი, თქვენი დავალებაა, რომ გამოიტანოთ მომხმარებლის სახელის პირველი ასო დიდ ასოდ და დაბეჭდოთ საბოლოო შედეგი, გამოიყენეთ შესაბამისი მეთოდი

username = input('ENTER YOUR BOOTIFUL NAME: ')
first_letter = username[0] #geting the first letter
first_letter_upper = first_letter.upper() #converting to uppercase
print(f'The first letter of your namein uppercase is: {first_letter_upper}')

print('----------------------------------------')

# 6) კომენტარების სახით ახსენით განსხვავება method, function - ს შორის

#ფუნქცია არის კოდის ბლოკი რომელიც ასრულებს კონკრეტულ სმოცანას და რომელსაც შეუძლია მიიღოს პარამეტრები და დააბრუნოს შედეგი.
#მეთოდი არის ფუნქცია რომელიც დაკავშირებულია კონკრეტულ ობიექტთან, მაგალითად string or massive,
#და გამოიყენება ამ ობიექტის მონაცემებზე ოპერაციების შესასრულებლად.
#მათ შორის მთავარი განსხვავება ის არის, რომ ყველა მეთოდი არის ფუნქცია, მაგრამ არა ყველა ფუნქცია არის მეთოდი.


# 7) name = '    N I N O     '

# გამოიყენეთ შესაბამისი მეთოდი იმისათვის, რომ მოაშოროთ ზედმეტი space - ები

name = '    N I N O    '
CLEANING = name.strip() #Using strip method to remove spaces
remove_spaced = name.replace(" ", "") #using replace method to finally remove all spaces
print(f"Name after wiping out spaces: '{remove_spaced}'")

print('----------------------------------------')

# 8) BONUS:
# შექმენით ფუნქცია სახელად greet რომელიც პარამეტრად მიიღებს name - ს, თქვენი დავალებაა, რომ დაბეჭდოთ მისალმება შემდეგნაირად Hello name, გამოიძახეთ მოცემული ფუნქცია და გადაეცით მას არგუმენტად სახელი, ასევე ახსენით განსხავვება პარამეტრსა და არგუმენტს შორის

name = input('ENTER YOUR NAME OR I WILL TUCH U: ')

def greet(): #name is a parameter
    print(f'HELLOOO {name}')

greet() #name is an argument

#პარამეტრი არის ცვლადი რომელიც გამოიყენება ფუნქციის განსაზღვრაში
#ხოლო არგუმენტი არის კონკრეტული მნიშვნელობა რომელიც გადაეცემა ფუნქციის პარამეტრს ფუნქციის გამოძახებისას.


print('----------------------------------------')