// 3) შექმენით ორი ცვლადი სადაც შეინახავთ თქვენს სახელს და ასაკს, თქცენი დავალებაა რომ გამოიტანოთ სტრინგი ფორმატში "მე მქვია (თქვენი სახელი) და ვარ (ასაკი) წლის, (გამოიყენეთ template ${} და string ლიტერალები ამ დავალების შესასრულებლად

const name = "მურმანი";
const age = 20;

console.log(`მე მქვია ${name} და ვარ ${age} წლის`);

// 4) შექმენით ცვლადი, და დღეს ნასწავლი ოპერატორით შეამოწმეთ ამ ცვლადში არსებული მნიშვნელობის მონაცემთა ტიპი და დააconsole.log ეთ შედეგი

let myVariable = "HAAAAAAAAAAAAAIIIIIIIIIIAAAAAAAAAA";

console.log(typeof myVariable);

// 5) შექმენი age.

// თუ ასაკი 18 ან მეტია, დაბეჭდე "ზრდასრულია", სხვა შემთხვევაში "არასრულწლოვანია".

let AGE = 20;

if (AGE >= 18) {console.log("ზრდასრულია");} 
  else {console.log("არასრულწლოვანია");}

// 6) შექმენი:

// let password = "12345";

// თუ პაროლი "12345"-ის ტოლია, დაბეჭდე "სწორი პაროლი", სხვა შემთხვევაში "არასწორი პაროლი".

let password = "12345";

if (password === "12345") {console.log("სწორი პაროლი");} 
  else {console.log("არასწორი პაროლი");}

// 7) შექმენი:

// let age = 20;
// let hasTicket = true;

// თუ ადამიანი 18 წლის ან მეტია და აქვს ბილეთი, დაბეჭდე "შესვლა შეიძლება", სხვა შემთხვევაში "შესვლა არ შეიძლება".

let Age = 20;
let hasTicket = true;

if (Age >= 18 && hasTicket) {console.log("შესვლა შეიძლება");} 
  else {console.log("შესვლა არ შეიძლება");}